{
        "topic": "T Pattern",
	"lessonGuidance":
	[
            "The pattern pictured is known as the T Pattern and is a very advanced pattern to recognize",
            "The one two tiles below the three only touches the two yellow tiles therefor there is a guaranteed mine in those tiles",
            "The one one space to the left only touches the two pink tiles therefor there is a guaranteed mine in those spaces(could be the same mine)",
            "The two touches all of the pink spaces so that's one mine accounted for The other mine is guaranteed to be in one of the orange spaces",
            "Now looking at the three the yellow and orange spaces contain a maximum of two mines meaning the space up and to the left is a guaranteed mine and can be flagged",
            "Continuing with the three one mine we just accounted for the second is in one of the two yellow spaces and the third is in one of the adjacent orange spaces this means the remaining orange spaces can be cleared"
        ],
	"quiz":
	{
                "width": 5,
                "height": 4,
		"minefield":
		[
                        true,
                        true,
                        false,
                        true,
                        false,
                        true,
			false,
                        false,
                        false,
                        false,
                        false,
                        true,
                        false,
                        false,
                        true,
                        false,
                        false,
                        false,
                        false,
                        false
		],
		"correctMoves":
		[
                    {
                        "cell":
                        {
                            "x": 1,
                            "y": 0
                        },
                        "type": 0
                    },
                    {
                        "cell":
                        {
                            "x": 4,
                            "y": 0
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 4,
                            "y": 1
                        },
                        "type": 1
                    }
                ],
                "completedMoves":
                [
                    {
                        "cell":
                        {
                            "x": 1,
                            "y": 1
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 2,
                            "y": 1
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 3,
                            "y": 1
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 2,
                            "y": 2
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 0,
                            "y": 3
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 1,
                            "y": 3
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 2,
                            "y": 3
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 3,
                            "y": 3
                        },
                        "type": 1
                    },
                    {
                        "cell":
                        {
                            "x": 4,
                            "y": 3
                        },
                        "type": 1
                    }
                ],
                "instructions":
                [
                    "Using the information about the pattern you just learned, FLAG and Clear each tile that you know 100% is a mine or not a mine going from top left to bottom right of the board. Click the \"Next\" button at the bottom right of your screen when you are done."
                ]

	}
}
